armfly/H7-TOOL_STM32H7_App/User/programmer/w25q_flash.c
/*
*********************************************************************************************************
*
*    模块名称 : 串行FLASH驱动
*    文件名称 : w25q_flash.c
*    版    本 : V1.0
*    说    明 : SPI串行FLASH驱动. 支持4路同步操作.
*    修改记录 :
*        版本号  日期       作者    说明
*        V1.0    2020-10-29 armfly  原创
*
*    Copyright (C), 2019-2030, 安富莱电子 www.armfly.com
*
*********************************************************************************************************
*/

#include "bsp.h"
#include "prog_if.h"
#include "DAP_config.h"
#include "n76e003_flash.h"
#include "w25q_flash.h"
#include "SW_DP_Multi.h"

/* 常用的厂商JEDEC ID */
#define SF_ID_CYPRESS                             0x01
#define SF_ID_FUJITSU                             0x04
#define SF_ID_EON                                 0x1C
#define SF_ID_ATMEL                               0x1F
#define SF_ID_MICRON                              0x20
#define SF_ID_AMIC                                0x37
#define SF_ID_SANYO                               0x62
#define SF_ID_INTEL                               0x89
#define SF_ID_ESMT                                0x8C
#define SF_ID_FUDAN                               0xA1
#define SF_ID_HYUNDAI                             0xAD
#define SF_ID_SST                                 0xBF
#define SF_ID_MICRONIX                            0xC2
#define SF_ID_GIGADEVICE                          0xC8
#define SF_ID_ISSI                                0xD5
#define SF_ID_WINBOND                             0xEF


#define CMD_DISWR	  0x04		/* 禁止写, 退出AAI状态 */
#define CMD_EWRSR	  0x50		/* 允许写状态寄存器的命令 */
#define CMD_WRSR      0x01  	/* 写状态寄存器命令 */
#define CMD_WREN      0x06		/* 写使能命令 */
#define CMD_READ      0x03  	/* 读数据区命令 */
#define CMD_RDSR      0x05		/* 读状态寄存器命令 */
#define CMD_RDID      0x9F		/* 读器件ID命令 */
#define CMD_SE        0x20		/* 擦除扇区命令 */
#define CMD_BE        0xC7		/* 批量擦除命令 */


//#define CMD_AAI         0xAD  	/* AAI 连续编程指令(FOR SST25VF016B) */
#define CMD_ERASE_CHIP  0xC7		/* CHIP擦除命令, 镁光的片子只支持C7，很多芯片同时支持60和C7 */
#define CMD_PAGE_PROG   0x02		/* page编程256字节 */

#define DUMMY_BYTE    0xA5		/* 哑命令，可以为任意值，用于读操作 */

#define WIP_FLAG      0x01		/* 状态寄存器中的正在编程标志（WIP) */

/*
    单路模式: 
    D0  PD14 PA15 PI0    - DIR PH8       CS2    
    D1  PD15 PA8 PH19    - DIR PG8       CS3
    
    D2  PE6  PD0 PB7     - DIR PD9       MOSI_1  (硬件SPI信号)
    D3  PE5  PD1 PH11    - DIR PG10      MISO_1  (硬件SPI信号)
    D4  PE4  PE7 PH12    - DIR PG12      CS1    (软件控制片选)
    D5  PE2  PE8 PI5     - DIR PG7       SCK     (硬件SPI信号)
    D6  PE9  PD3 PA0     - DIR PD10      MOSI_2
    D7  PE10 PI6         - DIR PI1       MISO_2  (第2路MISO) 
    D8  PE11 PD4  PI3    - DIR PG9       MISO_3  (第3路MISO)
    D9  PE12 PD5         - DIR PI12      MISO_4  (第4路MISO)
    
    RS232_TX             - RS232串口机台信号扩展 START BUSY OK NG
    RS232_RX             - RS232串口机台信号扩展


    SPI 时钟上升沿采集数据，下降沿改变数据
    
    四路模式: 

    D0  PD14 PA15 PI0    - DIR PH8       CS    =  PI0
        D1  PD15 PA8 PH19    - DIR PG8       SCK = PD15
    
        D2  PE6  PD0 PB7     - DIR PD9       MOSI_1 = PD0(写时) PE6(读时)
        D3  PE5  PD1 PH11    - DIR PG10      MOSI_2 = PD1(写时) PE5(读时)
    D4  PE4  PE7 PH12    - DIR PG12      MISO_1 = PE4
    D5  PE2  PE8 PI5     - DIR PG7       MISO_2 = PE2
    D6  PE9  PD3 PA0         - DIR PD10      MOSI_3 = PD3(写时) PE9(读时)
    D7  PE10 PI6         - DIR PI1       MISO_3 = PE10
        D8  PE11 PD4  PI3    - DIR PG9       MOSI_4 = PD4(写时) PE11(读时)
    D9  PE12 PD5         - DIR PI12      MISO_4 = PE12(读时)
    
    RS232_TX             - RS232串口机台信号扩展 START BUSY OK NG
    RS232_RX             - RS232串口机台信号扩展
    
    
    ----整理下----
    D0  = CS 
    D1  = SCK
    
    D2  = MOSI_1
    D3  = MOSI_2
    D4  = MISO_1
    D5  = MISO_2
    D6  = MOSI_3
    D7  = MISO_3
    D8  = MOSI_4
    D9  = MISO_4

    RS232_TX
    RS232_RX
*/

__forceinline void PIN_DELAY_SLOW (uint32_t delay) {
  uint32_t count;

  count = delay;
  while (count--);
}

#define PIN_DELAY_S()       PIN_DELAY_SLOW(g_tProg.SwdClockDelay)

/* 片选四路共用 */
#define W25_CS_0()          BSP_SET_GPIO_0(GPIOI, GPIO_PIN_0) 
#define W25_CS_1()          BSP_SET_GPIO_1(GPIOI, GPIO_PIN_0) 

/* 时钟通用 */
#define W25_SCK_0()         BSP_SET_GPIO_0(GPIOD, GPIO_PIN_15)
#define W25_SCK_1()         BSP_SET_GPIO_1(GPIOD, GPIO_PIN_15)

/* MOSI 四路不同 */
#define W25_MOSI1_PIN       GPIO_PIN_0
#define W25_MOSI2_PIN       GPIO_PIN_1
#define W25_MOSI3_PIN       GPIO_PIN_3
#define W25_MOSI4_PIN       GPIO_PIN_4

#define W25_SCK_PIN         GPIO_PIN_15

#define W25_MOSI1_0()       BSP_SET_GPIO_0(GPIOD, GPIO_PIN_0)
#define W25_MOSI1_1()       BSP_SET_GPIO_1(GPIOD, GPIO_PIN_0)
 
#define W25_MOSI2_0()       BSP_SET_GPIO_0(GPIOD, GPIO_PIN_1)
#define W25_MOSI2_1()       BSP_SET_GPIO_1(GPIOD, GPIO_PIN_1)

#define W25_MOSI3_0()       BSP_SET_GPIO_0(GPIOD, GPIO_PIN_3)
#define W25_MOSI3_1()       BSP_SET_GPIO_1(GPIOD, GPIO_PIN_3)

#define W25_MOSI4_0()       BSP_SET_GPIO_0(GPIOD, GPIO_PIN_4)
#define W25_MOSI4_1()       BSP_SET_GPIO_1(GPIOD, GPIO_PIN_4)

#define __W25_MOSI_0_SCK_0()  GPIOD->BSRR = (uint32_t)(GPIO_PIN_15 | GPIO_PIN_0 | GPIO_PIN_1 | GPIO_PIN_3 | GPIO_PIN_4) << 16
#define __W25_MOSI_1_SCK_0()  GPIOD->BSRR = GPIO_PIN_0 | GPIO_PIN_1 | GPIO_PIN_3 | GPIO_PIN_4 | ((uint32_t)GPIO_PIN_15 << 16)

/* MISO 四路不同 */

#define W25_READ_MISO()     GPIOE->IDR

#define W25_MISO1_PIN_A     GPIO_PIN_4
#define W25_MISO2_PIN_A     GPIO_PIN_2
#define W25_MISO3_PIN_A     GPIO_PIN_10
#define W25_MISO4_PIN_A     GPIO_PIN_12

#define W25_MISO1_PIN_B     GPIO_PIN_6
#define W25_MISO2_PIN_B     GPIO_PIN_5
#define W25_MISO3_PIN_B     GPIO_PIN_9
#define W25_MISO4_PIN_B     GPIO_PIN_11

/* MOSI设置为输出 D2 D3 D6 D8  === PD0 PD1 PD3 PD4 配置为输出  00000011 11001111 --- 00000001 01000101 */
#define W25_MOSI_SET_OUT()  BSP_SET_GPIO_1(GPIOD, GPIO_PIN_9 | GPIO_PIN_10); BSP_SET_GPIO_1(GPIOG, GPIO_PIN_9 | GPIO_PIN_10); \
    GPIOD->MODER = ((GPIOD->MODER & (~0x000003CF)) | 0x00000145);

/* MOSI设置为输入 */
#define W25_MOSI_SET_IN()  BSP_SET_GPIO_0(GPIOD, GPIO_PIN_9 | GPIO_PIN_10); BSP_SET_GPIO_0(GPIOG, GPIO_PIN_9 | GPIO_PIN_10); \
    GPIOD->MODER = GPIOD->MODER & (~0x000003CF);

