armfly/H7-TOOL_STM32H7_App/User/programmer/w25q_flash.c
static void W25Q_SendBit8Fast(uint8_t _data);
static void W25Q_SendBit8Slow(uint8_t _data);
static void W25Q_RaedBit8Fast(uint8_t *_rxbuf);
static void W25Q_RaedBit8Slow(uint8_t *_rxbuf);

void W25Q_UnlockBlock(void);
void W25Q_WriteStatusEnable(void);
uint8_t W25Q_WaitBusy(uint32_t _timeout);

W25Q_T g_tW25Q;

/*
*********************************************************************************************************
*    函 数 名: W25Q_InitHard
*    功能说明: ICP接口GPIO硬件初始化
*    形    参: 无
*    返 回 值: 无
*********************************************************************************************************
*/
void W25Q_InitHard(void)
{   
    EIO_D0_Config(ES_PROG_SPI_FLASH);
    EIO_D1_Config(ES_PROG_SPI_FLASH);
    EIO_D2_Config(ES_PROG_SPI_FLASH);
    EIO_D4_Config(ES_PROG_SPI_FLASH);
    EIO_D5_Config(ES_PROG_SPI_FLASH);
    EIO_D6_Config(ES_PROG_SPI_FLASH);

    EIO_D3_Config(ES_PROG_SPI_FLASH);    
    EIO_D7_Config(ES_PROG_SPI_FLASH);
    EIO_D8_Config(ES_PROG_SPI_FLASH);
    EIO_D9_Config(ES_PROG_SPI_FLASH);
    
    /* 选MODE3，平时SCK为1 */
    W25_SCK_1();    
    W25_CS_1();
    
    W25Q_UnlockBlock();         /* SST26VFxxx 需要解除块保护 */
}

static void W25_MOSI_0_SCK_0(void)
{
    if (g_gMulSwd.MultiMode == 0)   /* 单路烧录, */
    {
        GPIOD->BSRR = (uint32_t)(W25_SCK_PIN | W25_MOSI1_PIN) << 16;
    }
    else if (g_gMulSwd.MultiMode == 4)   /* 1拖4 烧录 */ 
    {
        GPIOD->BSRR = (uint32_t)(W25_SCK_PIN | W25_MOSI1_PIN | W25_MOSI2_PIN | W25_MOSI3_PIN | W25_MOSI4_PIN) << 16;
    }
    else if (g_gMulSwd.MultiMode == 3)   /* 1拖3 烧录 */
    {
        GPIOD->BSRR = (uint32_t)(W25_SCK_PIN | W25_MOSI1_PIN | W25_MOSI2_PIN | W25_MOSI3_PIN) << 16;
    }
    else if (g_gMulSwd.MultiMode == 2)   /* 1拖2 烧录 */
    {
        GPIOD->BSRR = (uint32_t)(W25_SCK_PIN | W25_MOSI1_PIN | W25_MOSI2_PIN) << 16;
    }
    else if (g_gMulSwd.MultiMode == 1)   /* 1拖1 烧录 */
    {
        if (g_gMulSwd.SwitchPin == 0)
        {
            GPIOD->BSRR = (uint32_t)(W25_SCK_PIN | W25_MOSI1_PIN) << 16;
        }
        else if (g_gMulSwd.SwitchPin == 1)
        {
            GPIOD->BSRR = (uint32_t)(W25_SCK_PIN | W25_MOSI2_PIN) << 16;
        }
        else if (g_gMulSwd.SwitchPin == 2)
        {
            GPIOD->BSRR = (uint32_t)(W25_SCK_PIN | W25_MOSI3_PIN) << 16;
        }
        else if (g_gMulSwd.SwitchPin == 3)
        {
            GPIOD->BSRR = (uint32_t)(W25_SCK_PIN | W25_MOSI4_PIN) << 16;
        } 
    }    
}

static void W25_MOSI_1_SCK_0(void)
{       
    if (g_gMulSwd.MultiMode == 0)   /* 单路烧录, */
    {
        GPIOD->BSRR = W25_MOSI1_PIN | ((uint32_t)W25_SCK_PIN << 16);
    }
    else if (g_gMulSwd.MultiMode == 4)   /* 1拖4 烧录 */ 
    {
        GPIOD->BSRR = W25_MOSI1_PIN | W25_MOSI2_PIN | W25_MOSI3_PIN | W25_MOSI4_PIN | ((uint32_t)W25_SCK_PIN << 16);
    }
    else if (g_gMulSwd.MultiMode == 3)   /* 1拖3 烧录 */
    {
        GPIOD->BSRR = W25_MOSI1_PIN | W25_MOSI2_PIN | W25_MOSI3_PIN | ((uint32_t)W25_SCK_PIN << 16);
    }
    else if (g_gMulSwd.MultiMode == 2)   /* 1拖2 烧录 */
    {
        GPIOD->BSRR = W25_MOSI1_PIN | W25_MOSI2_PIN | ((uint32_t)W25_SCK_PIN << 16);
    }
    else if (g_gMulSwd.MultiMode == 1)   /* 1拖1 烧录 */
    {
        if (g_gMulSwd.SwitchPin == 0)
        {
            GPIOD->BSRR = W25_MOSI1_PIN | ((uint32_t)W25_SCK_PIN << 16);
        }
        else if (g_gMulSwd.SwitchPin == 1)
        {
            GPIOD->BSRR = W25_MOSI2_PIN | ((uint32_t)W25_SCK_PIN << 16);
        }
        else if (g_gMulSwd.SwitchPin == 2)
        {
            GPIOD->BSRR = W25_MOSI3_PIN | ((uint32_t)W25_SCK_PIN << 16);
        }
        else if (g_gMulSwd.SwitchPin == 3)
        {
            GPIOD->BSRR = W25_MOSI4_PIN | ((uint32_t)W25_SCK_PIN << 16);
        } 
    }    
}

/*
*********************************************************************************************************
*    函 数 名: W25Q_SendBit8Fast
*    功能说明: 传输8bit
*    形    参: _data：数据
*    返 回 值: 无
*********************************************************************************************************
*/ 
static void W25Q_SendBit8Fast(uint8_t _data)
{
    uint8_t i;
    
    /* SCK下降沿改变数据，上升沿采集数据, 平时SCK = 1 */
    for (i = 0; i < 8; i++)
    {
        if (_data & 0x80)
        {
            W25_MOSI_1_SCK_0();
        }
        else
        {
            W25_MOSI_0_SCK_0();
        }        
        W25_SCK_1();         
        _data <<= 1;      
    }
}

/*
*********************************************************************************************************
*    函 数 名: W25Q_SendBit8Slow
*    功能说明: 传输8bit, 低速模式, 用于进入和退出IAP
*    形    参: _data：数据
*    返 回 值: 无
*********************************************************************************************************
*/ 
static void W25Q_SendBit8Slow(uint8_t _data)
{
    uint8_t i;
      
    /* SCK下降沿改变数据，上升沿采集数据, 平时SCK = 1 */
    for (i = 0; i < 8; i++)
    {
        if (_data & 0x80)
        {
            W25_MOSI_1_SCK_0();
        }
        else
        {
            W25_MOSI_0_SCK_0();
        }        
        PIN_DELAY_S();
        W25_SCK_1();         
        _data <<= 1;
        PIN_DELAY_S();        

    }
}

/*
*********************************************************************************************************
*    函 数 名: W25Q_RaedBit8Fast
*    功能说明: 读8bit数据，4通道同步
*    形    参: 无
*    返 回 值: 4通道的数据
*********************************************************************************************************
*/ 
static void W25Q_RaedBit8Fast(uint8_t *_rxbuf)
{
    uint8_t i;
    uint32_t gpio;
    uint32_t ret = 0;
    
    /* SCK下降沿改变数据，上升沿采集数据, 平时SCK = 1 */
    for (i = 0; i < 8; i++)
    {        
        W25_SCK_0();
        ret <<= 1;
        W25_SCK_1();
        gpio = W25_READ_MISO();    
       
        if (g_gMulSwd.MultiMode == 0)
        {
            if (gpio & W25_MISO1_PIN_A)
            {
                ret |= 0x00000001;
            }
        }
        else if (g_gMulSwd.MultiMode == 4)
        {
            if (gpio & W25_MISO1_PIN_A)
            {
                ret |= 0x00000001;
            }
            if (gpio & W25_MISO2_PIN_A)
            {
                ret |= 0x00000100;
            }
            if (gpio & W25_MISO3_PIN_A)
            {
                ret |= 0x00010000;
            }
            if (gpio & W25_MISO4_PIN_A)
            {
                ret |= 0x01000000;
            }
        }        
        else if (g_gMulSwd.MultiMode == 3)
        {
            if (gpio & W25_MISO1_PIN_A)
            {
                ret |= 0x00000001;
            }
            if (gpio & W25_MISO2_PIN_A)
            {
                ret |= 0x00000100;
            }
            if (gpio & W25_MISO3_PIN_A)
            {
                ret |= 0x00010000;
            }
        }         
        else if (g_gMulSwd.MultiMode == 2)
        {
            if (gpio & W25_MISO1_PIN_A)
            {
                ret |= 0x00000001;
            }
            if (gpio & W25_MISO2_PIN_A)
            {
                ret |= 0x00000100;
            }
        }
        else if (g_gMulSwd.MultiMode == 1)
        {
            if (g_gMulSwd.SwitchPin == 0)
            {    
                if (gpio & W25_MISO1_PIN_A)
                {
                    ret |= 0x00000001;
                }
            }
            else if (g_gMulSwd.SwitchPin == 1)
            {    
                if (gpio & W25_MISO2_PIN_A)
                {
                    ret |= 0x00000001;
                }
            }
            else if (g_gMulSwd.SwitchPin == 2)
            {    
                if (gpio & W25_MISO3_PIN_A)
                {
                    ret |= 0x00000001;
                }
            }
            else if (g_gMulSwd.SwitchPin == 3)
            {    
                if (gpio & W25_MISO4_PIN_A)
                {
                    ret |= 0x00000001;
                }
            }
        }        
    }
    
