armfly/H7-TOOL_STM32H7_App/User/programmer/w25q_flash.c
    _rxbuf[0] = ret;
    _rxbuf[1] = ret >> 8;
    _rxbuf[2] = ret >> 16;
    _rxbuf[3] = ret >> 24;
}

/*
*********************************************************************************************************
*    函 数 名: W25Q_RaedBit8FastDaul
*    功能说明: 读8bit数据，4通道同步， 双线
*    形    参: 无
*    返 回 值: 4通道的数据
*********************************************************************************************************
*/ 
static void W25Q_RaedBit8FastDaul(uint8_t *_rxbuf)
{
    uint8_t i;
    uint32_t gpio;
    uint32_t ret = 0;
    
    /* SCK下降沿改变数据，上升沿采集数据, 平时SCK = 1 */
    for (i = 0; i < 4; i++)
    {        
        W25_SCK_0();
        
        if (g_gMulSwd.MultiMode == 0)
        {
            if (gpio & W25_MISO1_PIN_B)
            {
                ret |= 0x00000001;
            }
            if (gpio & W25_MISO1_PIN_A)
            {
                ret |= 0x00000002;
            }
        }
        else if (g_gMulSwd.MultiMode == 4)
        {
            if (gpio & W25_MISO1_PIN_B)
            {
                ret |= 0x00000001;
            }
            if (gpio & W25_MISO1_PIN_A)
            {
                ret |= 0x00000002;
            }
            
            if (gpio & W25_MISO2_PIN_B)
            {
                ret |= 0x00000100;
            }
            if (gpio & W25_MISO2_PIN_A)
            {
                ret |= 0x00000200;
            }
            
            if (gpio & W25_MISO3_PIN_B)
            {
                ret |= 0x00010000;
            }
            if (gpio & W25_MISO3_PIN_A)
            {
                ret |= 0x00020000;
            }
            
            if (gpio & W25_MISO4_PIN_B)
            {
                ret |= 0x01000000;
            }
            if (gpio & W25_MISO4_PIN_A)
            {
                ret |= 0x02000000;
            }
        }        
        else if (g_gMulSwd.MultiMode == 3)
        {
            if (gpio & W25_MISO1_PIN_B)
            {
                ret |= 0x00000001;
            }
            if (gpio & W25_MISO1_PIN_A)
            {
                ret |= 0x00000002;
            }
            
            if (gpio & W25_MISO2_PIN_B)
            {
                ret |= 0x00000100;
            }
            if (gpio & W25_MISO2_PIN_A)
            {
                ret |= 0x00000200;
            }
            
            if (gpio & W25_MISO3_PIN_B)
            {
                ret |= 0x00010000;
            }
            if (gpio & W25_MISO3_PIN_A)
            {
                ret |= 0x00020000;
            }
        }         
        else if (g_gMulSwd.MultiMode == 2)
        {
            if (gpio & W25_MISO1_PIN_B)
            {
                ret |= 0x00000001;
            }
            if (gpio & W25_MISO1_PIN_A)
            {
                ret |= 0x00000002;
            }
            
            if (gpio & W25_MISO2_PIN_B)
            {
                ret |= 0x00000100;
            }
            if (gpio & W25_MISO2_PIN_A)
            {
                ret |= 0x00000200;
            }
        }
        else if (g_gMulSwd.MultiMode == 1)
        {
            if (g_gMulSwd.SwitchPin == 0)
            {    
                if (gpio & W25_MISO1_PIN_B)
                {
                    ret |= 0x00000001;
                }
                if (gpio & W25_MISO1_PIN_A)
                {
                    ret |= 0x00000002;
                }
            }
            else if (g_gMulSwd.SwitchPin == 1)
            {    
                if (gpio & W25_MISO2_PIN_B)
                {
                    ret |= 0x00000001;
                }
                if (gpio & W25_MISO2_PIN_A)
                {
                    ret |= 0x00000002;
                }
            }
            else if (g_gMulSwd.SwitchPin == 2)
            {    
                if (gpio & W25_MISO3_PIN_B)
                {
                    ret |= 0x00000001;
                }
                if (gpio & W25_MISO3_PIN_A)
                {
                    ret |= 0x00000002;
                }
            }
            else if (g_gMulSwd.SwitchPin == 3)
            {    
                if (gpio & W25_MISO4_PIN_B)
                {
                    ret |= 0x00000001;
                }
                if (gpio & W25_MISO4_PIN_A)
                {
                    ret |= 0x00000002;
                }
            }
        }     
 
        ret <<= 2;        
        W25_SCK_1();
        gpio = W25_READ_MISO();            
    }

    _rxbuf[0] = ret;
    _rxbuf[1] = ret >> 8;
    _rxbuf[2] = ret >> 16;
    _rxbuf[3] = ret >> 24;
}

/*
*********************************************************************************************************
*    函 数 名: W25Q_RaedBit8Slow
*    功能说明: 读8bit数据，4通道同步， 双线
*    形    参: 无
*    返 回 值: 4通道的数据
*********************************************************************************************************
*/ 
static void W25Q_RaedBit8Slow(uint8_t *_rxbuf)
{
    uint8_t i;
    uint32_t gpio;
    uint32_t ret = 0;
    
    /* SCK下降沿改变数据，上升沿采集数据, 平时SCK = 1 */
    for (i = 0; i < 8; i++)
    {
        W25_SCK_0();
        PIN_DELAY_S();
        ret <<= 1;
        W25_SCK_1();         
        gpio = W25_READ_MISO();
        PIN_DELAY_S();
        
        if (g_gMulSwd.MultiMode == 0)
        {
            if (gpio & W25_MISO1_PIN_A)
            {
                ret |= 0x00000001;
            }
        }
        else if (g_gMulSwd.MultiMode == 4)
        {
            if (gpio & W25_MISO1_PIN_A)
            {
                ret |= 0x00000001;
            }
            if (gpio & W25_MISO2_PIN_A)
            {
                ret |= 0x00000100;
            }
            if (gpio & W25_MISO3_PIN_A)
            {
                ret |= 0x00010000;
            }
            if (gpio & W25_MISO4_PIN_A)
            {
                ret |= 0x01000000;
            }
        }        
        else if (g_gMulSwd.MultiMode == 3)
        {
            if (gpio & W25_MISO1_PIN_A)
            {
                ret |= 0x00000001;
            }
            if (gpio & W25_MISO2_PIN_A)
            {
                ret |= 0x00000100;
            }
            if (gpio & W25_MISO3_PIN_A)
            {
                ret |= 0x00010000;
            }
        }         
        else if (g_gMulSwd.MultiMode == 2)
        {
            if (gpio & W25_MISO1_PIN_A)
            {
                ret |= 0x00000001;
            }
            if (gpio & W25_MISO2_PIN_A)
            {
                ret |= 0x00000100;
            }
        }
        else if (g_gMulSwd.MultiMode == 1)
        {
            if (g_gMulSwd.SwitchPin == 0)
            {    
                if (gpio & W25_MISO1_PIN_A)
                {
                    ret |= 0x00000001;
                }
            }
            else if (g_gMulSwd.SwitchPin == 1)
            {    
                if (gpio & W25_MISO2_PIN_A)
                {
                    ret |= 0x00000001;
                }
            }
            else if (g_gMulSwd.SwitchPin == 2)
            {    
                if (gpio & W25_MISO3_PIN_A)
                {
                    ret |= 0x00000001;
                }
            }
            else if (g_gMulSwd.SwitchPin == 3)
            {    
                if (gpio & W25_MISO4_PIN_A)
                {
                    ret |= 0x00000001;
                }
            }
        }                         
    }
    _rxbuf[0] = ret;
    _rxbuf[1] = ret >> 8;
    _rxbuf[2] = ret >> 16;
    _rxbuf[3] = ret >> 24;       
}

static void W25Q_RaedBit8SlowDaul(uint8_t *_rxbuf)
{
    uint8_t i;
    uint32_t gpio;
    uint32_t ret = 0;
    
