armfly/H7-TOOL_STM32H7_App/User/programmer/w25q_flash.c
    /* SCK下降沿改变数据，上升沿采集数据, 平时SCK = 1 */
    for (i = 0; i < 4; i++)
    {
        W25_SCK_0();
        PIN_DELAY_S();             
        ret <<= 2;
        W25_SCK_1();
        PIN_DELAY_S();
        gpio = W25_READ_MISO();     
        
        if (gpio & W25_MISO1_PIN_B)
        {
            ret |= 0x00000001;
        }
        if (gpio & W25_MISO1_PIN_A)
        {
            ret |= 0x00000002;
        }
        
        if (gpio & W25_MISO2_PIN_B)
        {
            ret |= 0x00000100;
        }
        if (gpio & W25_MISO2_PIN_A)
        {
            ret |= 0x00000200;
        }
        
        if (gpio & W25_MISO3_PIN_B)
        {
            ret |= 0x00010000;
        }
        if (gpio & W25_MISO3_PIN_A)
        {
            ret |= 0x00020000;
        }
        
        if (gpio & W25_MISO4_PIN_B)
        {
            ret |= 0x01000000;
        }
        if (gpio & W25_MISO4_PIN_A)
        {
            ret |= 0x02000000;
        }       
    }
    _rxbuf[0] = ret;
    _rxbuf[1] = ret >> 8;
    _rxbuf[2] = ret >> 16;
    _rxbuf[3] = ret >> 24;       
}

/*
*********************************************************************************************************
*    函 数 名: W25Q_SendData
*    功能说明: 发送数据
*    形    参: _cmd : 命令
*              _addr : 地址     
*    返 回 值: 无
*********************************************************************************************************
*/ 
static void W25Q_SendData(uint8_t *_txbuf, uint16_t _txlen)
{
    uint16_t i;
    
    W25_CS_0();
    if (g_tProg.SwdClockDelay == 0)
    {
        for (i = 0;i < _txlen; i++)
        {
            W25Q_SendBit8Fast(_txbuf[i]);
        }
    }
    else
    {
        for (i = 0;i < _txlen; i++)
        {
            W25Q_SendBit8Slow(_txbuf[i]);
        }
    }
    W25_CS_1();
}

// 不拉高CS
static void W25Q_SendData0(uint8_t *_txbuf, uint16_t _txlen)
{
    uint16_t i;
    
    W25_CS_0();
    if (g_tProg.SwdClockDelay == 0)
    {
        for (i = 0;i < _txlen; i++)
        {
            W25Q_SendBit8Fast(_txbuf[i]);
        }
    }
    else
    {
        for (i = 0;i < _txlen; i++)
        {
            W25Q_SendBit8Slow(_txbuf[i]);
        }
    }
    //W25_CS_1();
}

/*
*********************************************************************************************************
*    函 数 名: W25Q_ReadData
*    功能说明: 读回数据. 4路同步读回
*    形    参:  
*    返 回 值: 无
*********************************************************************************************************
*/
#if 0
static void W25Q_ReadData(uint8_t *_rxbuf, uint16_t _rxlen)
{
    uint16_t i;
    uint8_t buf[4];
    
    W25_CS_0();
    if (g_tProg.SwdClockDelay == 0)
    {
        for (i = 0;i < _rxlen; i++)
        {
            W25Q_RaedBit8Fast(buf);
            
            _rxbuf[4 * i] = buf[0];
            _rxbuf[4 * i + 1] = buf[1];
            _rxbuf[4 * i + 2] = buf[2];
            _rxbuf[4 * i + 3] = buf[3];
        }        
    }
    else
    {
        for (i = 0;i < _rxlen; i++)
        {
            W25Q_RaedBit8Slow(buf);
            
            _rxbuf[4 * i] = buf[0];
            _rxbuf[4 * i + 1] = buf[1];
            _rxbuf[4 * i + 2] = buf[2];
            _rxbuf[4 * i + 3] = buf[3];
        }
    }
    W25_CS_1();
}
#endif

/*
*********************************************************************************************************
*    函 数 名: W25Q_SendAndReadData
*    功能说明: 发送并且读回数据(单线)
*    形    参: 
*    返 回 值: 无
*********************************************************************************************************
*/ 
static void W25Q_SendAndReadData(uint8_t *_txbuf, uint32_t _txlen, uint8_t *_rxbuf, uint32_t _rxlen)
{
    uint32_t i;
    uint8_t buf[4];    
    
    W25_CS_0();
    if (g_tProg.SwdClockDelay == 0)
    {
        for (i = 0;i < _txlen; i++)
        {
            W25Q_SendBit8Fast(_txbuf[i]);
        }
        
        for (i = 0; i < _rxlen; i++)
        {
            W25Q_RaedBit8Fast(buf);
            
            if (g_gMulSwd.MultiMode > 0)   /* 多路模式 */
            {
                _rxbuf[i] = buf[0];
                _rxbuf[_rxlen + i] = buf[1];
                _rxbuf[2 * _rxlen + i] = buf[2];
                _rxbuf[3 * _rxlen + i] = buf[3];
            }
            else    /* 单路模式 */
            {
                _rxbuf[i] = buf[0];
            }
        }
    }
    else
    {
        for (i = 0;i < _txlen; i++)
        {
            W25Q_SendBit8Slow(_txbuf[i]);
        }
        
        for (i = 0;i < _rxlen; i++)
        {
            W25Q_RaedBit8Slow(buf);
            
            if (g_gMulSwd.MultiMode > 0)   /* 多路模式 */
            {
                _rxbuf[i] = buf[0];
                _rxbuf[_rxlen + i] = buf[1];
                _rxbuf[2 * _rxlen + i] = buf[2];
                _rxbuf[3 * _rxlen + i] = buf[3];
            }
            else
            {
                _rxbuf[i] = buf[0];
            }
        }        
    }
   
    W25_CS_1();
}

/*
*********************************************************************************************************
*    函 数 名: W25Q_SendAndReadDataDaul
*    功能说明: 发送并且读回数据(双线)
*    形    参:  
*    返 回 值: 无
*********************************************************************************************************
*/ 
static void W25Q_SendAndReadDataDaul(uint8_t *_txbuf, uint32_t _txlen, uint8_t *_rxbuf, uint32_t _rxlen)
{
    uint32_t i;
    uint8_t buf[4];    
    
    W25_CS_0();
    if (g_tProg.SwdClockDelay == 0)
    {
        for (i = 0;i < _txlen; i++)
        {
            W25Q_SendBit8Fast(_txbuf[i]);
        }
        
        /* 切换MOSI 为输入 */
        W25_MOSI_SET_IN();
        
        for (i = 0; i < _rxlen; i++)
        {
            W25Q_RaedBit8FastDaul(buf);
            
            if (g_gMulSwd.MultiMode > 0)   /* 多路模式 */
            {
                _rxbuf[i] = buf[0];
                _rxbuf[_rxlen + i] = buf[1];
                _rxbuf[2 * _rxlen + i] = buf[2];
                _rxbuf[3 * _rxlen + i] = buf[3];
            }
            else    /* 单路模式 */
            {
                _rxbuf[i] = buf[0];
            }
        }
        /* 切换MOSI 为输出 */
        W25_MOSI_SET_OUT();         
    }
    else
    {
        for (i = 0;i < _txlen; i++)
        {
            W25Q_SendBit8Slow(_txbuf[i]);
        }
        
        /* 切换MOSI 为输入 */
        W25_MOSI_SET_IN();
        
        for (i = 0;i < _rxlen; i++)
        {
            W25Q_RaedBit8SlowDaul(buf);
            
            if (g_gMulSwd.MultiMode > 0)   /* 多路模式 */
            {
                _rxbuf[i] = buf[0];
                _rxbuf[_rxlen + i] = buf[1];
                _rxbuf[2 * _rxlen + i] = buf[2];
                _rxbuf[3 * _rxlen + i] = buf[3];
            }
            else
            {
                _rxbuf[i] = buf[0];
            }
        }

