armfly/H7-TOOL_STM32H7_App/User/programmer/w25q_flash.c
        /* 切换MOSI 为输出 */
        W25_MOSI_SET_OUT();        
    }
    W25_CS_1();
}

/*
*********************************************************************************************************
*    函 数 名: W25Q_SendAndReadDataBlank
*    功能说明: 发送并且读回数据(单线), 判断是否为空
*    形    参: 
*    返 回 值: 1 表示空片， 0表示不空需要擦除
*********************************************************************************************************
*/ 
static uint8_t W25Q_SendAndReadDataBlank(uint8_t *_txbuf, uint32_t _txlen, uint32_t _rxlen)
{
    uint32_t i;
    uint8_t buf[4];
    uint8_t blank = 1;
    
    W25_CS_0();
    if (g_tProg.SwdClockDelay == 0)
    {
        for (i = 0;i < _txlen; i++)
        {
            W25Q_SendBit8Fast(_txbuf[i]);
        }
        
        for (i = 0; i < _rxlen; i++)
        {
            W25Q_RaedBit8Fast(buf);
            
            if (g_gMulSwd.MultiMode > 0)   /* 多路模式 */
            {
                uint8_t k;
                
                for (k = 0; k < g_gMulSwd.MultiMode; k++)
                {
                    if (buf[k] != 0xFF)
                    {
                        blank = 0;  /* 不空 */
                        break;
                    }
                }
            }
            else    /* 单路模式 */
            {
                if (buf[0] != 0xFF)
                {
                    blank = 0;  /* 不空 */
                    break;                    
                }
            }
        }
    }
    else
    {
        for (i = 0;i < _txlen; i++)
        {
            W25Q_SendBit8Slow(_txbuf[i]);
        }
        
        for (i = 0;i < _rxlen; i++)
        {
            W25Q_RaedBit8Slow(buf);
            
            if (g_gMulSwd.MultiMode > 0)   /* 多路模式 */
            {
                uint8_t k;
                
                for (k = 0; k < g_gMulSwd.MultiMode; k++)
                {
                    if (buf[k] != 0xFF)
                    {
                        blank = 0;  /* 不空 */
                        break;
                    }
                }
            }
            else
            {
                if (buf[0] != 0xFF)
                {
                    blank = 0;  /* 不空 */
                    break;                    
                }
            }
        }        
    }
   
    W25_CS_1();
    
    return blank;
}

/*
*********************************************************************************************************
*    函 数 名: W25Q_SendAndReadDataBlankDaul
*    功能说明: 发送并且读回数据(双线), 判断是否为空
*    形    参:  
*    返 回 值: 无
*********************************************************************************************************
*/ 
static uint8_t W25Q_SendAndReadDataBlankDaul(uint8_t *_txbuf, uint32_t _txlen, uint32_t _rxlen)
{
    uint32_t i;
    uint8_t buf[4];    
    uint8_t blank = 1;
    
    W25_CS_0();
    if (g_tProg.SwdClockDelay == 0)
    {
        for (i = 0;i < _txlen; i++)
        {
            W25Q_SendBit8Fast(_txbuf[i]);
        }
        
        /* 切换MOSI 为输入 */
        W25_MOSI_SET_IN();
        
        for (i = 0; i < _rxlen; i++)
        {
            W25Q_RaedBit8FastDaul(buf);
            
            if (g_gMulSwd.MultiMode > 0)   /* 多路模式 */
            {
                uint8_t k;
                
                for (k = 0; k < g_gMulSwd.MultiMode; k++)
                {
                    if (buf[k] != 0xFF)
                    {
                        blank = 0;  /* 不空 */
                        break;
                    }
                }
            }
            else    /* 单路模式 */
            {
                if (buf[0] != 0xFF)
                {
                    blank = 0;  /* 不空 */
                    break;                    
                }
            }
        }
        /* 切换MOSI 为输出 */
        W25_MOSI_SET_OUT();         
    }
    else
    {
        for (i = 0;i < _txlen; i++)
        {
            W25Q_SendBit8Slow(_txbuf[i]);
        }
        
        /* 切换MOSI 为输入 */
        W25_MOSI_SET_IN();
        
        for (i = 0;i < _rxlen; i++)
        {
            W25Q_RaedBit8SlowDaul(buf);
            
            if (g_gMulSwd.MultiMode > 0)   /* 多路模式 */
            {
                uint8_t k;
                
                for (k = 0; k < g_gMulSwd.MultiMode; k++)
                {
                    if (buf[k] != 0xFF)
                    {
                        blank = 0;  /* 不空 */
                        break;
                    }
                }
            }
            else
            {
                if (buf[0] != 0xFF)
                {
                    blank = 0;  /* 不空 */
                    break;                    
                }
            }
        }

        /* 切换MOSI 为输出 */
        W25_MOSI_SET_OUT();        
    }
    W25_CS_1();
    
    return blank;    
}

/*
*********************************************************************************************************
*    函 数 名: W25Q_DetectIC
*    功能说明: 检测IC是否在位
*    形    参: _id 读取4FFC开始的数字，当做芯片识别码
*    返 回 值: 1表示OK  0表示错误
*********************************************************************************************************
*/ 
uint8_t W25Q_DetectIC(uint32_t *_id)
{
    uint8_t txbuf[5];
    uint8_t rxbuf[3 * 4];
    uint8_t i;
    
    if (g_tW25Q.ReadIDCmd == 0x9F)
    {
        txbuf[0] = 0x9F;    
        W25Q_SendAndReadData(txbuf, 1, rxbuf,3);
        
        for (i = 0; i < 4; i++)
        {
            if (rxbuf[4 * i + 0] == 0 || rxbuf[4 * i + 0] == 0xFF)  /* 判断厂家ID */
            {
                _id[i] = 0;     /* 无效ID，做无芯片处理 */
            }
            else
            {        
                _id[i] =    ((rxbuf[3 * i + 0] << 16) & 0x00FF0000) + 
                            ((rxbuf[3 * i + 1] << 8) & 0x0000FF00) + 
                            ((rxbuf[3 * i + 2] << 0) & 0x000000FF);
            }
        }
    }
    else if (g_tW25Q.ReadIDCmd == 0x90 || g_tW25Q.ReadIDCmd == 0xAB)     /* SST */
    {
        txbuf[0] = g_tW25Q.ReadIDCmd; 
        txbuf[1] = 0;
        txbuf[2] = 0;
        txbuf[3] = 0;       
        W25Q_SendAndReadData(txbuf, 4, rxbuf, 2);
        
