armfly/H7-TOOL_STM32H7_App/User/programmer/w25q_flash.c
        for (i = 0; i < 4; i++)
        {
            if (rxbuf[4 * i + 0] == 0 || rxbuf[4 * i + 0] == 0xFF)  /* 判断厂家ID */
            {
                _id[i] = 0;     /* 无效ID，做无芯片处理 */
            }
            else
            {        
                _id[i] =    ((rxbuf[2 * i + 0] << 8) & 0x00FF00) + 
                            ((rxbuf[2 * i + 1] << 0) & 0x0000FF);       
            }
        }            
    }
    return 1;
}

/*
*********************************************************************************************************
*    函 数 名: W25Q_WriteBuf
*    功能说明: 连续写多个字节.  不支持的操作。没有内存或寄存器可以操作
*    形    参: _Addr : 3个字节的地址。整数值
*              _Buf : 输入数据缓冲区
*              _Len : 字节长度
*    返 回 值: 1表示OK, 0表示出错
*********************************************************************************************************
*/ 
uint8_t W25Q_WriteBuf(uint32_t _Addr, uint8_t *_Buf, uint16_t _Len)
{
    return 1;
}

/*
*********************************************************************************************************
*    函 数 名: W25Q_CheckBlank
*    功能说明: 读取连续多个字节数据. APROM。  LDROM的数据地址 + 0x10000
*    形    参: _Addr : 3个字节的地址。整数值
*              _Len : 字节长度
*    返 回 值: 1表示空片，0表示不空
*********************************************************************************************************
*/ 
uint8_t W25Q_CheckBlank(uint32_t _Addr, uint32_t _Len)
{
    uint8_t txbuf[5];
    uint8_t re;

    if (g_tW25Q.Capacity > 16 * 1024 * 1024)
    {
        /* 进入四字节地址模式 */
        txbuf[0] =  0xB7;
        W25Q_SendData(txbuf, 1);
    }
        
    if (g_tW25Q.ReadMode == 0)  /* 单线 */
    {
        if (_Addr > 16 * 1024 * 1024)
        {
            txbuf[0] = 0x13;    /* 4字节地址，读 */
            txbuf[1] = _Addr >> 24;
            txbuf[2] = _Addr >> 16;
            txbuf[3] = _Addr >> 8;
            txbuf[4] = _Addr;                
            
            re = W25Q_SendAndReadDataBlank(txbuf, 5, _Len);    /* 查空 */
        }
        else    
        {
            txbuf[0] = 0x03;    /* 3字节地址，读 */
            txbuf[1] = _Addr >> 16;
            txbuf[2] = _Addr >> 8;
            txbuf[3] = _Addr;        
            re = W25Q_SendAndReadDataBlank(txbuf, 4, _Len);        
        }
    }
    else if (g_tW25Q.ReadMode == 1)  /* 双线 */
    {
        if (_Addr > 16 * 1024 * 1024)
        {
            txbuf[0] = 0x3C;    /* 4字节地址，读 Read daul output */
            txbuf[1] = _Addr >> 24;
            txbuf[2] = _Addr >> 16;
            txbuf[3] = _Addr >> 8;
            txbuf[4] = _Addr;                
            
            re = W25Q_SendAndReadDataBlankDaul(txbuf, 5, _Len);
        }
        else    
        {
            txbuf[0] = 0x3B;    /* 3字节地址，读 Read daul output */
            txbuf[1] = _Addr >> 16;
            txbuf[2] = _Addr >> 8;
            txbuf[3] = _Addr;        
            re = W25Q_SendAndReadDataBlankDaul(txbuf, 4, _Len);        
        }
    }

    return re;
}

/*
*********************************************************************************************************
*	函 数 名: W25Q_WriteEnable
*	功能说明: 向器件发送写使能命令
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
void W25Q_WriteEnable(void)
{
    uint8_t txbuf[1];
    
    txbuf[0] = CMD_WREN;
    W25Q_SendData(txbuf, 1); 
}

/*
*********************************************************************************************************
*	函 数 名: W25Q_WriteStatusEnable
*	功能说明: 向器件发送写状态字使能命令
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
void W25Q_WriteStatusEnable(void)
{
    uint8_t txbuf[1];
    
    txbuf[0] = CMD_EWRSR;
    W25Q_SendData(txbuf, 1); 
}

/*
*********************************************************************************************************
*	函 数 名: W25Q_WriteDisable
*	功能说明: 向器件发送写禁止命令
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
void W25Q_WriteDisable(void)
{
    uint8_t txbuf[1];
    
    txbuf[0] = CMD_DISWR;
    W25Q_SendData(txbuf, 1); 
}


/*
*********************************************************************************************************
*	函 数 名: W25Q_WriteStatus
*	功能说明: 向器件发送写状态字指令
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
void W25Q_WriteStatus(uint8_t _value)
{
    uint8_t txbuf[2];
    
    txbuf[0] = CMD_WRSR;
    txbuf[1] = _value;
    W25Q_SendData(txbuf, 2); 
}

/*
*********************************************************************************************************
*    函 数 名: W25Q_UnlockBlock
*    功能说明: 解锁写保护。 在擦除全片和扇区时执行
*    形    参: _addr 地址
*    返 回 值: 无
*********************************************************************************************************
*/ 
void W25Q_UnlockBlock(void)
{
    if (g_tW25Q.UnlockCmd > 0x00)   // SST26 是0x98指令全局解锁保护
    {
        uint8_t txbuf[1];
        
        W25Q_WriteEnable();
        
        txbuf[0] = g_tW25Q.UnlockCmd;
        W25Q_SendData(txbuf, 1); 
    }
    else  // 0x00 表示写状态寄存器00
    {          
        if (g_tW25Q.AutoAddrInc > 0)   // SST25 特殊，缺省是保护，未启用AAI
        {
            W25Q_WriteEnable();
            
            W25Q_WaitBusy(200);
            
            W25Q_WriteStatusEnable();   
            
            W25Q_WriteStatus(0x00);			/* 解除所有BLOCK的写保护 */
        }
    }
}

/*
*********************************************************************************************************
*    函 数 名: W25Q_WaitBusy
*    功能说明: 等待操作结束
*    形    参: _addr 地址
*    返 回 值: 1表示OK, 0表示出错
*********************************************************************************************************
*/ 
uint8_t W25Q_WaitBusy(uint32_t _timeout)
{
    int32_t time1;
    uint8_t txbuf[1];
    uint8_t rxbuf[4];   /* 4路的状态字 */
    uint8_t i;
    int32_t timedisp;
    uint8_t ch_num;
    
    time1 = bsp_GetRunTime();
    timedisp = bsp_GetRunTime();
    txbuf[0] = (CMD_RDSR);	        /* 发送命令， 读状态寄存器 */ 
    
