armfly/H7-TOOL_STM32H7_App/User/programmer/w25q_flash.c
    if ( g_gMulSwd.MultiMode == 0)
    {
        ch_num = 1;
    }
    else
    {
        ch_num = g_gMulSwd.MultiMode;        /* 多路烧录 */
    }
    
	while(1)
	{
        if (bsp_CheckRunTime(time1) > _timeout + 5000)
        {
            printf("W25Q_WaitBusy(%d) is timeout", _timeout);
            break;   /* 超时 */
        }
                
        if (bsp_CheckRunTime(timedisp) > 500)
        {
            timedisp = bsp_GetRunTime();

            {
                float percent;
                int32_t tt;
                
                tt = bsp_CheckRunTime(time1);
                percent = ((float)tt / _timeout) * 100;
                PG_PrintPercent(percent, 0);
                bsp_Idle();                  
            }          
        }
        
        W25Q_SendAndReadData(txbuf, 1, rxbuf, 1);        
		
        if (g_gMulSwd.MultiMode == 0)   /* 单路烧录 */
        {
            if ((rxbuf[0] & WIP_FLAG) != 0)	    
            {
                ;
            }
            else
            {
                return 1;   /* OK */
            }
        }
        else    /* 多路模式 */
        {
            uint8_t err = 0;
            
            if (g_tProg.AbortOnError == 1)   /* 有1个错误 则返回错误 */
            {
                for (i = 0; i < ch_num; i++)
                {
                    if (g_gMulSwd.Active[i] == 1)
                    {
                        if ((rxbuf[i] & WIP_FLAG) != 0)	    
                        {
                            err = 1;
                        }
                    }
                }
                
                if (err == 0)
                {
                    return 1;   /* OK */
                }
            }
            else
            {
                for (i = 0; i < ch_num; i++)
                {
                    if (g_gMulSwd.Active[i] == 1 && g_gMulSwd.Error[i] == 0)
                    {
                        if ((rxbuf[i] & WIP_FLAG) != 0)	    
                        {
                            err = 1;
                        }
                    }
                }
                
                if (err == 0)
                {
                    return 1;   /* OK */
                }
            }
        }        	
	}
    return 0;
}

/*
*********************************************************************************************************
*    函 数 名: W25Q_EraseSector
*    功能说明: 擦除扇区, 一般4K,  先检查是否为空
*    形    参: _addr 地址
*    返 回 值: 1表示OK, 0表示出错
*********************************************************************************************************
*/ 
uint8_t W25Q_EraseSector(uint32_t _Addr)
{
    uint8_t buf[5];    
    
    
    /* 先判断是否为空，再擦除 */
    if (W25Q_CheckBlank(_Addr, g_tW25Q.SectorSize) == 1)
    {
        return 1;
    }        
    
    W25Q_WriteEnable();
    
    buf[0] = g_tW25Q.EraseSectorCmd;    
    if (g_tW25Q.Capacity > 16 * 1024 * 1024)
    {
        buf[1] = _Addr >> 24;
        buf[2] = _Addr >> 16;
        buf[3] = _Addr >> 8;
        buf[4] = _Addr >> 0;
        W25Q_SendData(buf, 5);
    }
    else    /* 3字节模式 */
    {
        buf[1] = _Addr >> 16;
        buf[2] = _Addr >> 8;
        buf[3] = _Addr >> 0;
        W25Q_SendData(buf, 4);    
    }
    
    return W25Q_WaitBusy(g_tW25Q.EraseSectorTimeout);
}

/*
*********************************************************************************************************
*    函 数 名: W25Q_EraseSector
*    功能说明: 擦除整片
*    形    参: 无
*    返 回 值: 1表示OK, 0表示出错
*********************************************************************************************************
*/ 
uint8_t W25Q_EraseChip(void)
{
    uint8_t buf[4];    
    
    W25Q_WriteEnable();
    
    buf[0] = g_tW25Q.EraseChipCmd;    /* 整片擦除指令 */
    W25Q_SendData(buf, 1);
    
    return W25Q_WaitBusy(g_tW25Q.EraseChipTimeout);
}

/*
*********************************************************************************************************
*    函 数 名: W25Q_FLASH_ProgramBuf
*    功能说明: Programs a memory block。  页大小256字节
*    形    参: _FlashAddr : 绝对地址。 
*              _Buff : Pointer to buffer containing source data.
*              _Size : 数据大小，可以大于1个block
*    返 回 值: 0 : 出错;  1 : 成功
*********************************************************************************************************
*/ 
uint8_t W25Q_FLASH_ProgramBuf(uint32_t _Addr, uint8_t *_Buff, uint32_t _Size)
{
    if (g_tW25Q.AutoAddrInc == 0)   /* 256 page 写入模式 */
    {
        uint8_t txbuf[5];
        uint32_t i;
        
        if (g_tW25Q.Capacity > 16 * 1024 * 1024)
        {
            /* 进入四字节地址模式 */
            txbuf[0] =  0xB7;
            W25Q_SendData(txbuf, 1);
        }
        
        for (i = 0; i < _Size / 256; i++)
        {
            W25Q_WriteEnable();
            
            txbuf[0] = CMD_PAGE_PROG;       
            if (g_tW25Q.Capacity > 16 * 1024 * 1024)
            {
                txbuf[1] = _Addr >> 24;
                txbuf[2] = _Addr >> 16;
                txbuf[3] = _Addr >> 8;
                txbuf[4] = _Addr >> 0;
                W25Q_SendData0(txbuf, 5);   /* 发送完毕不拉高CS */
            }
            else    /* 3字节模式 */
            {
                txbuf[1] = _Addr >> 16;
                txbuf[2] = _Addr >> 8;
                txbuf[3] = _Addr >> 0; 
                W25Q_SendData0(txbuf, 4);  /* 发送完毕不拉高CS */
            }
            
            W25Q_SendData(_Buff, 256);     /* 发送完毕拉高CS */
            
            if (W25Q_WaitBusy(g_tW25Q.ProgPageTimeout) == 0)
            {
                return 0;   /* 超时异常 */
            }
            
            _Addr += 256;
            _Buff += 256;
        }
    }
    else    /* 地址递增模式  SST25VF020 以下单字节  040以上双字节 */
    {
        uint8_t txbuf[6];
        uint32_t i;
        
        W25Q_WriteEnable();
        
        if (g_tW25Q.AutoAddrInc == 0xAF)    /* 单字节AAI */
        {
            txbuf[0] = g_tW25Q.AutoAddrInc;
            txbuf[1] = _Addr >> 16;
            txbuf[2] = _Addr >> 8;
            txbuf[3] = _Addr >> 0; 
            txbuf[4] = *_Buff++;
            W25Q_SendData(txbuf, 5);     /* 发送完毕拉高CS */

            if (W25Q_WaitBusy(g_tW25Q.ProgPageTimeout) == 0)
            {
                return 0;   /* 超时异常 */
            }
            
            for (i = 0; i < (_Size - 1) / 1; i++)
            {
                txbuf[0] = g_tW25Q.AutoAddrInc;
                txbuf[1] = *_Buff++;
                W25Q_SendData(txbuf, 2);     /* 发送完毕拉高CS */
                
                if (W25Q_WaitBusy(g_tW25Q.ProgPageTimeout) == 0)
                {
                    return 0;   /* 超时异常 */
                }
            }
        }
        else    /* 0xAD, 双字节AAI */
        {
            txbuf[0] = g_tW25Q.AutoAddrInc;
            txbuf[1] = _Addr >> 16;
            txbuf[2] = _Addr >> 8;
            txbuf[3] = _Addr >> 0; 
            txbuf[4] = *_Buff++;
            txbuf[5] = *_Buff++;
            W25Q_SendData(txbuf, 6);     /* 发送完毕拉高CS */

            if (W25Q_WaitBusy(g_tW25Q.ProgPageTimeout) == 0)
            {
                return 0;   /* 超时异常 */
            }
            
            for (i = 0; i < (_Size - 2) / 2; i++)
            {
                txbuf[0] = g_tW25Q.AutoAddrInc;
                txbuf[1] = *_Buff++;
                txbuf[2] = *_Buff++;
                W25Q_SendData(txbuf, 3);     /* 发送完毕拉高CS */
                
                if (W25Q_WaitBusy(g_tW25Q.ProgPageTimeout) == 0)
                {
                    return 0;   /* 超时异常 */
                }
            }            
        }
        
        // 退出AAI
        W25Q_WriteDisable();

        if (W25Q_WaitBusy(g_tW25Q.ProgPageTimeout) == 0)
        {
            return 0;   /* 超时异常 */
        }        
    }
    return 1;
}    


