armfly/H7-TOOL_STM32H7_App/User/programmer/w25q_flash.c
/*
*********************************************************************************************************
*    函 数 名: W25Q_ReadBuf
*    功能说明: 读取连续多个字节数据. APROM。  LDROM的数据地址 + 0x10000
*    形    参: _Addr : 3个字节的地址。整数值
*              _Buf : 目标缓冲区
*              _Len : 字节长度
*    返 回 值: 1表示成功，0表示失败
*********************************************************************************************************
*/ 
uint8_t W25Q_ReadBuf(uint32_t _Addr, uint8_t *_Buf, uint16_t _Len)
{
    uint8_t txbuf[6];

    if (g_tW25Q.Capacity > 16 * 1024 * 1024)
    {
        /* 进入四字节地址模式 */
        txbuf[0] =  0xB7;
        W25Q_SendData(txbuf, 1);
    }
    
    if (g_tW25Q.ReadMode == 0)  /* 单线 */
    {
        if (g_tW25Q.Capacity > 16 * 1024 * 1024)
        {
            txbuf[0] = 0x03;    /* 4字节地址，读 */
            txbuf[1] = _Addr >> 24;
            txbuf[2] = _Addr >> 16;
            txbuf[3] = _Addr >> 8;
            txbuf[4] = _Addr;                
            
            W25Q_SendAndReadData(txbuf, 5, _Buf, _Len);
        }
        else    
        {
            txbuf[0] = 0x03;    /* 3字节地址，读 */
            txbuf[1] = _Addr >> 16;
            txbuf[2] = _Addr >> 8;
            txbuf[3] = _Addr;        
            W25Q_SendAndReadData(txbuf, 4, _Buf, _Len);        
        }
    }
    else if (g_tW25Q.ReadMode == 1)  /* 双线 */
    {
        if (g_tW25Q.Capacity > 16 * 1024 * 1024)
        {
            txbuf[0] = 0x3B;    /* 4字节地址，读 Read daul output */
            txbuf[1] = _Addr >> 24;
            txbuf[2] = _Addr >> 16;
            txbuf[3] = _Addr >> 8;
            txbuf[4] = _Addr;                
            txbuf[5] = 0;      /* 空闲字节 */  
            W25Q_SendAndReadDataDaul(txbuf, 6, _Buf, _Len);
        }
        else    
        {
            txbuf[0] = 0x3B;    /* 3字节地址，读 Read daul output */
            txbuf[1] = _Addr >> 16;
            txbuf[2] = _Addr >> 8;
            txbuf[3] = _Addr;
            txbuf[4] = 0;      /* 空闲字节 */      
            W25Q_SendAndReadDataDaul(txbuf, 5, _Buf, _Len);        
        }
    }

    return 1;
}

/***************************** 安富莱电子 www.armfly.com (END OF FILE) *********************************/
